<?php 

    $_['text_error_req']       = 'الحقل %s يجب ان يحتوي على قيمة ';
    $_['text_error_num']       = 'الحقل %s يجب ان يحتوي على رقم';
    $_['text_error_int']       = 'الحقل %s يجب ان يحتوي على رقم صحيح';
    $_['text_error_float']     = 'الحقل %s يجب ان يحتوي على رقم عشري';
    $_['text_error_alpha']     = 'الحقل %s يجب ان يحتوي على احرف فقط';
    $_['text_error_alphanum']  = 'الحقل %s  يجب ان يحتوي على احرف  وأرقام فقط' ;
    $_['text_error_eq']        = '%s يجب ان تكون قيمته مساوية ل %s' ;
    $_['text_error_eq_field']  = '%s يجب ان تتساوى  قيمته مع %s '  ;
    $_['text_error_lt']        = 'الحقل %s  يجب ان يكون أقل من  %s' ;
    $_['text_error_gt']        = 'الحقل %s  يجب ان يكون أكثر من  %s';
    $_['text_error_min']       = 'الحقل %s يجب ان تكون قيمته على الاقل %s (احرف ان كان نصيا)';
    $_['text_error_max']       = 'الحقل %s يجب ان تكون قيمته على الأكثر %s (احرف ان كان نصيا)';
    $_['text_error_between']   = 'الحقل %s يجب ان تكون قيمته ما بين %s و %s (احرف ان كان نصيا)';
    $_['text_error_floatlike'] = 'الحقل %s يجب ان تكون قيمته ما بين %s و %s (احرف ان كان نصيا)';
    $_['text_error_vdate']     = 'الحقل %s يجب أن يكون تاريخ بتنسيق YYYY-mm-dd ';
    $_['text_error_email']     = 'الحقل %s يجب أن يكون بريدا الكترونيا Ex: someone@mail.com';
    $_['text_error_url']       = 'الحقل %s يجب أن يكون رابط صحيح  Ex: http://www.abc.com ';
